shared_with_qemu/fio_results/iomap_v1_patch_8G_mem_write_bs-4k_20250812-181951.log
buffered-write: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.36
Starting 1 process

buffered-write: (groupid=0, jobs=1): err= 0: pid=1204: Tue Aug 12 18:19:54 2025
  write: IOPS=109k, BW=425MiB/s (446MB/s)(1024MiB/2407msec); 0 zone resets
    clat (usec): min=6, max=1123, avg= 7.65, stdev= 3.98
     lat (usec): min=6, max=1123, avg= 7.90, stdev= 4.18
    clat percentiles (usec):
     |  1.00th=[    7],  5.00th=[    8], 10.00th=[    8], 20.00th=[    8],
     | 30.00th=[    8], 40.00th=[    8], 50.00th=[    8], 60.00th=[    8],
     | 70.00th=[    8], 80.00th=[    8], 90.00th=[    8], 95.00th=[    9],
     | 99.00th=[   11], 99.50th=[   17], 99.90th=[   60], 99.95th=[   71],
     | 99.99th=[  122]
   bw (  KiB/s): min=416439, max=449480, per=99.79%, avg=434725.50, stdev=15062.29, samples=4
   iops        : min=104135, max=112372, avg=108689.00, stdev=3755.32, samples=4
  lat (usec)   : 10=98.79%, 20=0.92%, 50=0.11%, 100=0.16%, 250=0.02%
  lat (usec)   : 500=0.01%, 750=0.01%
  lat (msec)   : 2=0.01%
  cpu          : usr=77.11%, sys=21.73%, ctx=3, majf=0, minf=13
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,262144,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=425MiB/s (446MB/s), 425MiB/s-425MiB/s (446MB/s-446MB/s), io=1024MiB (1074MB), run=2407-2407msec

Disk stats (read/write):
  vdc: ios=0/0, sectors=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%