shared_with_qemu/fio_results/iomap_v1_patch_8G_mem_write_bs-4k_20250812-182009.log
buffered-write: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.36
Starting 1 process

buffered-write: (groupid=0, jobs=1): err= 0: pid=1284: Tue Aug 12 18:20:12 2025
  write: IOPS=108k, BW=422MiB/s (442MB/s)(1024MiB/2427msec); 0 zone resets
    clat (usec): min=6, max=576, avg= 7.65, stdev= 3.15
     lat (usec): min=6, max=832, avg= 7.87, stdev= 3.49
    clat percentiles (usec):
     |  1.00th=[    8],  5.00th=[    8], 10.00th=[    8], 20.00th=[    8],
     | 30.00th=[    8], 40.00th=[    8], 50.00th=[    8], 60.00th=[    8],
     | 70.00th=[    8], 80.00th=[    8], 90.00th=[    8], 95.00th=[    9],
     | 99.00th=[   12], 99.50th=[   16], 99.90th=[   53], 99.95th=[   64],
     | 99.99th=[  109]
   bw (  KiB/s): min=418752, max=441520, per=99.96%, avg=431890.50, stdev=9573.80, samples=4
   iops        : min=104706, max=110384, avg=107979.00, stdev=2386.57, samples=4
  lat (usec)   : 10=98.49%, 20=1.23%, 50=0.16%, 100=0.11%, 250=0.01%
  lat (usec)   : 500=0.01%, 750=0.01%
  cpu          : usr=72.92%, sys=26.13%, ctx=7, majf=0, minf=13
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,262144,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=422MiB/s (442MB/s), 422MiB/s-422MiB/s (442MB/s-442MB/s), io=1024MiB (1074MB), run=2427-2427msec

Disk stats (read/write):
  vdc: ios=0/0, sectors=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%