shared_with_qemu/fio_results/vanila_8G_mem_read_bs-128k_20250808-212758.log
buffered-read: (g=0): rw=read, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=psync, iodepth=1
fio-3.36
Starting 1 process

buffered-read: (groupid=0, jobs=1): err= 0: pid=1786: Fri Aug  8 21:28:01 2025
  read: IOPS=5501, BW=688MiB/s (721MB/s)(1024MiB/1489msec)
    clat (usec): min=32, max=1637, avg=175.88, stdev=135.90
     lat (usec): min=32, max=1746, avg=177.09, stdev=136.34
    clat percentiles (usec):
     |  1.00th=[   35],  5.00th=[   37], 10.00th=[   38], 20.00th=[   40],
     | 30.00th=[   41], 40.00th=[   46], 50.00th=[  206], 60.00th=[  251],
     | 70.00th=[  285], 80.00th=[  297], 90.00th=[  318], 95.00th=[  383],
     | 99.00th=[  506], 99.50th=[  545], 99.90th=[  709], 99.95th=[  750],
     | 99.99th=[ 1631]
   bw (  KiB/s): min=692375, max=733184, per=100.00%, avg=712779.50, stdev=28856.32, samples=2
   iops        : min= 5409, max= 5728, avg=5568.50, stdev=225.57, samples=2
  lat (usec)   : 50=41.89%, 100=0.85%, 250=17.09%, 500=39.01%, 750=1.10%
  lat (usec)   : 1000=0.04%
  lat (msec)   : 2=0.01%
  cpu          : usr=3.49%, sys=75.40%, ctx=85, majf=0, minf=44
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=8192,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=688MiB/s (721MB/s), 688MiB/s-688MiB/s (721MB/s-721MB/s), io=1024MiB (1074MB), run=1489-1489msec

Disk stats (read/write):
  vdc: ios=3757/0, sectors=1922576/0, merge=0/0, ticks=809/0, in_queue=809, util=41.99%