shared_with_qemu/fio_results/vanila_8G_mem_read_bs-4k_20250808-212705.log
buffered-read: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.36
Starting 1 process

buffered-read: (groupid=0, jobs=1): err= 0: pid=1474: Fri Aug  8 21:27:09 2025
  read: IOPS=112k, BW=437MiB/s (458MB/s)(1024MiB/2345msec)
    clat (usec): min=2, max=1064, avg= 7.37, stdev=26.08
     lat (usec): min=2, max=1178, avg= 7.63, stdev=26.23
    clat percentiles (usec):
     |  1.00th=[    3],  5.00th=[    3], 10.00th=[    3], 20.00th=[    3],
     | 30.00th=[    3], 40.00th=[    3], 50.00th=[    3], 60.00th=[    4],
     | 70.00th=[    4], 80.00th=[    4], 90.00th=[    4], 95.00th=[    7],
     | 99.00th=[  180], 99.50th=[  190], 99.90th=[  241], 99.95th=[  351],
     | 99.99th=[  412]
   bw (  KiB/s): min=443064, max=455249, per=100.00%, avg=449492.00, stdev=5366.42, samples=4
   iops        : min=110768, max=113816, avg=112376.25, stdev=1340.99, samples=4
  lat (usec)   : 4=92.18%, 10=3.72%, 20=0.64%, 50=0.49%, 100=1.29%
  lat (usec)   : 250=1.60%, 500=0.08%, 750=0.01%
  lat (msec)   : 2=0.01%
  cpu          : usr=40.55%, sys=46.99%, ctx=11, majf=0, minf=14
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=262144,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=437MiB/s (458MB/s), 437MiB/s-437MiB/s (458MB/s-458MB/s), io=1024MiB (1074MB), run=2345-2345msec

Disk stats (read/write):
  vdc: ios=3712/0, sectors=1896944/0, merge=0/0, ticks=848/0, in_queue=848, util=34.45%