shared_with_qemu/fio_results/vanila_8G_mem_write_bs-10M_20250808-213337.log
buffered-write: (g=0): rw=write, bs=(R) 10.0MiB-10.0MiB, (W) 10.0MiB-10.0MiB, (T) 10.0MiB-10.0MiB, ioengine=psync, iodepth=1
fio-3.36
Starting 1 process

buffered-write: (groupid=0, jobs=1): err= 0: pid=2467: Fri Aug  8 21:33:40 2025
  write: IOPS=36, BW=361MiB/s (379MB/s)(1020MiB/2822msec); 0 zone resets
    clat (usec): min=12336, max=14024, avg=12761.23, stdev=249.30
     lat (usec): min=12698, max=15102, avg=13212.40, stdev=309.47
    clat percentiles (usec):
     |  1.00th=[12387],  5.00th=[12518], 10.00th=[12518], 20.00th=[12518],
     | 30.00th=[12649], 40.00th=[12649], 50.00th=[12780], 60.00th=[12780],
     | 70.00th=[12780], 80.00th=[12911], 90.00th=[13042], 95.00th=[13173],
     | 99.00th=[13829], 99.50th=[14091], 99.90th=[14091], 99.95th=[14091],
     | 99.99th=[14091]
   bw (  KiB/s): min=40960, max=778240, per=100.00%, avg=525653.33, stdev=419881.62, samples=3
   iops        : min=    4, max=   76, avg=51.33, stdev=41.00, samples=3
  lat (msec)   : 20=100.00%
  cpu          : usr=1.28%, sys=86.49%, ctx=25, majf=0, minf=13
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,102,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=361MiB/s (379MB/s), 361MiB/s-361MiB/s (379MB/s-379MB/s), io=1020MiB (1070MB), run=2822-2822msec

Disk stats (read/write):
  vdc: ios=0/278, sectors=0/2088960, merge=0/0, ticks=0/159652, in_queue=159653, util=40.38%