shared_with_qemu/fio_results/vanila_hole_8G_mem_read_bs-128k_20250809-071454.log
buffered-read: (g=0): rw=read, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=psync, iodepth=1
fio-3.36
Starting 1 process

buffered-read: (groupid=0, jobs=1): err= 0: pid=1639: Sat Aug  9 07:14:57 2025
  read: IOPS=6287, BW=786MiB/s (824MB/s)(1024MiB/1303msec)
    clat (usec): min=24, max=1874, avg=156.70, stdev=138.88
     lat (usec): min=24, max=1874, avg=156.97, stdev=138.98
    clat percentiles (usec):
     |  1.00th=[   26],  5.00th=[   26], 10.00th=[   26], 20.00th=[   27],
     | 30.00th=[   28], 40.00th=[   29], 50.00th=[  143], 60.00th=[  262],
     | 70.00th=[  269], 80.00th=[  273], 90.00th=[  289], 95.00th=[  318],
     | 99.00th=[  449], 99.50th=[  474], 99.90th=[ 1020], 99.95th=[ 1450],
     | 99.99th=[ 1876]
   bw (  KiB/s): min=791504, max=828416, per=100.00%, avg=809960.00, stdev=26100.73, samples=2
   iops        : min= 6187, max= 6472, avg=6329.50, stdev=201.53, samples=2
  lat (usec)   : 50=49.61%, 100=0.35%, 250=0.04%, 500=49.66%, 750=0.17%
  lat (usec)   : 1000=0.06%
  lat (msec)   : 2=0.11%
  cpu          : usr=5.15%, sys=93.70%, ctx=2, majf=0, minf=44
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=8192,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=786MiB/s (824MB/s), 786MiB/s-786MiB/s (824MB/s-824MB/s), io=1024MiB (1074MB), run=1303-1303msec

Disk stats (read/write):
  vdc: ios=0/0, sectors=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%