shared_with_qemu/fio_results/vanila_hole_8G_mem_read_bs-1G_20250809-071402.log
buffered-read: (g=0): rw=read, bs=(R) 1024MiB-1024MiB, (W) 1024MiB-1024MiB, (T) 1024MiB-1024MiB, ioengine=psync, iodepth=1
fio-3.36
Starting 1 process

buffered-read: (groupid=0, jobs=1): err= 0: pid=1303: Sat Aug  9 07:14:05 2025
  read: IOPS=0, BW=627MiB/s (657MB/s)(1024MiB/1634msec)
    clat (nsec): min=1631.4M, max=1631.4M, avg=1631426640.00, stdev= 0.00
     lat (nsec): min=1631.5M, max=1631.5M, avg=1631538688.00, stdev= 0.00
    clat percentiles (msec):
     |  1.00th=[ 1636],  5.00th=[ 1636], 10.00th=[ 1636], 20.00th=[ 1636],
     | 30.00th=[ 1636], 40.00th=[ 1636], 50.00th=[ 1636], 60.00th=[ 1636],
     | 70.00th=[ 1636], 80.00th=[ 1636], 90.00th=[ 1636], 95.00th=[ 1636],
     | 99.00th=[ 1636], 99.50th=[ 1636], 99.90th=[ 1636], 99.95th=[ 1636],
     | 99.99th=[ 1636]
  lat (msec)   : 2000=100.00%
  cpu          : usr=0.06%, sys=98.47%, ctx=3, majf=0, minf=1035
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=627MiB/s (657MB/s), 627MiB/s-627MiB/s (657MB/s-657MB/s), io=1024MiB (1074MB), run=1634-1634msec

Disk stats (read/write):
  vdc: ios=0/0, sectors=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%