shared_with_qemu/fio_results/vanila_hole_8G_mem_read_bs-4k_20250809-071423.log
buffered-read: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
fio-3.36
Starting 1 process

buffered-read: (groupid=0, jobs=1): err= 0: pid=1447: Sat Aug  9 07:14:27 2025
  read: IOPS=121k, BW=473MiB/s (496MB/s)(1024MiB/2164msec)
    clat (usec): min=2, max=2435, avg= 6.93, stdev=34.84
     lat (usec): min=2, max=2435, avg= 7.11, stdev=34.85
    clat percentiles (usec):
     |  1.00th=[    3],  5.00th=[    3], 10.00th=[    3], 20.00th=[    3],
     | 30.00th=[    3], 40.00th=[    3], 50.00th=[    3], 60.00th=[    3],
     | 70.00th=[    3], 80.00th=[    3], 90.00th=[    3], 95.00th=[    4],
     | 99.00th=[  249], 99.50th=[  269], 99.90th=[  363], 99.95th=[  420],
     | 99.99th=[  529]
   bw (  KiB/s): min=442360, max=515352, per=99.66%, avg=482884.00, stdev=31006.77, samples=4
   iops        : min=110606, max=128836, avg=120734.00, stdev=7745.48, samples=4
  lat (usec)   : 4=96.69%, 10=1.55%, 20=0.12%, 50=0.04%, 100=0.03%
  lat (usec)   : 250=0.65%, 500=0.90%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%
  cpu          : usr=46.40%, sys=52.50%, ctx=3, majf=0, minf=13
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=262144,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=473MiB/s (496MB/s), 473MiB/s-473MiB/s (496MB/s-496MB/s), io=1024MiB (1074MB), run=2164-2164msec

Disk stats (read/write):
  vdc: ios=0/0, sectors=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%